spring2019/psyc3435/psyc3435-spring2019.org
#+TITLE: PSYC 3435: Principles of Research for the Behavioral Sciences
#+AUTHOR: 
#+DATE: Spring 2019
#+OPTIONS: toc:nil
#+OPTIONS: num:nil
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [10pt]
#+LATEX_HEADER: \usepackage[left=1in,right=1in,bottom=1in,top=1in]{geometry}

** Contact info
- Professor: Thomas J. Faulkenberry, Ph.D
- Office: Math 319
- Office hours: MWF 1-3 pm, TR 9-11 am
- Email: faulkenberry@tarleton.edu
- Website: [[http://tomfaulkenberry.github.io]]
- Phone: 254-968-9816

** Course description

This laboratory course is designed to introduce students to the philosophy of scientific inquiry with an emphasis on experimental methodology. This will be accomplished via a combination of traditional lectures along with an application of principles through laboratory experimentation and demonstration. Essentially, we will cover the "nuts and bolts" of putting together and completing a research project in psychology. To this end, we will cover all fourteen chapters of the textbook. All students enrolled in this course are required to have *previously taken* PSYC 3309 (Writing in Psychology) and PSYC 3330 (Statistics). 

** Course materials

- /The Process of Research in Psychology/ (3rd ed.) by McBride (2015) [[https://www.amazon.com/Process-Research-Psychology-Dawn-McBride/dp/1483347605/][Amazon link]]
- /APA Publication Manual/ (6th ed.) [[http://www.amazon.com/Publication-Manual-American-Psychological-Association/dp/1433805618/][Amazon link]]
- JASP statistical software (free download from [[http://jasp-stats.org][jasp-stats.org]])

** Student learning outcomes

1. Describe advantages of the scientific method compared to other approaches
2. Identify various research designs and uses of each
3. Conduct library research
4. Paraphrase and cite material from primary sources 
5. Develop a research question and write hypotheses appropriate for it
6. Design and conduct a research project to test hypotheses
7. Analyze data collected from research using computer software
8. Communicate the findings of research as a complete APA style manuscript

** Requirements and grading

- Exam 1 (100 pts)
- Exam 2 (100 pts)
- Exam 3 (100 pts)
- Final exam (150 pts)
- Unit quizzes (100 pts)
- Lab assignments (100 pts)
- Research participation (50 pts)
- /Total = 700 points/

Grades will be assigned based on the percentage of points you accumulate out of these 700 points.  I will use the standard grading scale of A=90%, B=80%, etc.

*** Exams (64% of grade)
There will be four exams throughout the semester.  They will cover material from the text and the lectures.  Exam questions will be a mix of multiple choice and short answer and will be worth 100 points each.

Dates:

- Exam 1 (Wednesday, Feb 13)
- Exam 2 (Wednesday, March 27)
- Exam 3 (Wednesday, April 24)
- Final exam (Monday, May 6, 3:00-5:30 pm)

*** Unit quizzes (14% of grade)

Every Friday (excluding exam weeks), there will be a short in-class quiz over the material covered in lectures on Monday and Wednesday. Typically, the quizzes will consist of multiple choice questions, although the format may change occasionally depending on material.  Your final quiz average will be scaled to a total of 100 points for the semester (i.e., if you average 8.6/10 points over all quizzes, your final quiz grade will be 86/100).

