spring2019/psyc3435/psyc3435-spring2019.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-14 Mon 09:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PSYC 3435: Principles of Research for the Behavioral Sciences</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">PSYC 3435: Principles of Research for the Behavioral Sciences</h1>

<div id="outline-container-orgacb11ab" class="outline-2">
<h2 id="orgacb11ab">Contact info</h2>
<div class="outline-text-2" id="text-orgacb11ab">
<ul class="org-ul">
<li>Professor: Thomas J. Faulkenberry, Ph.D</li>
<li>Office: Math 319</li>
<li>Office hours: MWF 1-3 pm, TR 9-11 am</li>
<li>Email: faulkenberry@tarleton.edu</li>
<li>Website: <a href="http://tomfaulkenberry.github.io">http://tomfaulkenberry.github.io</a></li>
<li>Phone: 254-968-9816</li>
</ul>
</div>
</div>

<div id="outline-container-org3142a18" class="outline-2">
<h2 id="org3142a18">Course description</h2>
<div class="outline-text-2" id="text-org3142a18">
<p>
This laboratory course is designed to introduce students to the philosophy of scientific inquiry with an emphasis on experimental methodology. This will be accomplished via a combination of traditional lectures along with an application of principles through laboratory experimentation and demonstration. Essentially, we will cover the "nuts and bolts" of putting together and completing a research project in psychology. To this end, we will cover all fourteen chapters of the textbook. All students enrolled in this course are required to have <b>previously taken</b> PSYC 3309 (Writing in Psychology) and PSYC 3330 (Statistics). 
</p>
</div>
</div>

<div id="outline-container-org531c6f0" class="outline-2">
<h2 id="org531c6f0">Course materials</h2>
<div class="outline-text-2" id="text-org531c6f0">
<ul class="org-ul">
<li><i>The Process of Research in Psychology</i> (3rd ed.) by McBride (2015) <a href="https://www.amazon.com/Process-Research-Psychology-Dawn-McBride/dp/1483347605/">Amazon link</a></li>
<li><i>APA Publication Manual</i> (6th ed.) <a href="http://www.amazon.com/Publication-Manual-American-Psychological-Association/dp/1433805618/">Amazon link</a></li>
<li>JASP statistical software (free download from <a href="http://jasp-stats.org">jasp-stats.org</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-orga3cff79" class="outline-2">
<h2 id="orga3cff79">Student learning outcomes</h2>
<div class="outline-text-2" id="text-orga3cff79">
<ol class="org-ol">
<li>Describe advantages of the scientific method compared to other approaches</li>
<li>Identify various research designs and uses of each</li>
<li>Conduct library research</li>
<li>Paraphrase and cite material from primary sources</li>
<li>Develop a research question and write hypotheses appropriate for it</li>
<li>Design and conduct a research project to test hypotheses</li>
<li>Analyze data collected from research using computer software</li>
<li>Communicate the findings of research as a complete APA style manuscript</li>
</ol>
</div>
</div>

<div id="outline-container-orgc6e2fd2" class="outline-2">
<h2 id="orgc6e2fd2">Requirements and grading</h2>
<div class="outline-text-2" id="text-orgc6e2fd2">
<ul class="org-ul">
<li>Exam 1 (100 pts)</li>
<li>Exam 2 (100 pts)</li>
<li>Exam 3 (100 pts)</li>
<li>Final exam (150 pts)</li>
<li>Unit quizzes (100 pts)</li>
<li>Lab assignments (100 pts)</li>
<li>Research participation (50 pts)</li>
<li><i>Total = 700 points</i></li>
</ul>

<p>
Grades will be assigned based on the percentage of points you accumulate out of these 700 points.  I will use the standard grading scale of A=90%, B=80%, etc.
</p>
</div>

<div id="outline-container-org4328bc8" class="outline-3">
<h3 id="org4328bc8">Exams (64% of grade)</h3>
<div class="outline-text-3" id="text-org4328bc8">
<p>
There will be four exams throughout the semester.  They will cover material from the text and the lectures.  Exam questions will be a mix of multiple choice and short answer and will be worth 100 points each.
</p>

<p>
Dates:
</p>

<ul class="org-ul">
<li>Exam 1 (Wednesday, Feb 13)</li>
<li>Exam 2 (Wednesday, March 27)</li>
<li>Exam 3 (Wednesday, April 24)</li>
<li>Final exam (Monday, May 6, 3:00-5:30 pm)</li>
</ul>
</div>
</div>

<div id="outline-container-org30d9372" class="outline-3">
<h3 id="org30d9372">Unit quizzes (14% of grade)</h3>
<div class="outline-text-3" id="text-org30d9372">
<p>
Every Friday (excluding exam weeks), there will be a short in-class quiz over the material covered in lectures on Monday and Wednesday. Typically, the quizzes will consist of multiple choice questions, although the format may change occasionally depending on material.  Your final quiz average will be scaled to a total of 100 points for the semester (i.e., if you average 8.6/10 points over all quizzes, your final quiz grade will be 86/100).
</p>
</div>
</div>
