spring2019/psyc3435/psyc3435-spring2019.tex
% Created 2019-01-14 Mon 09:21
% Intended LaTeX compiler: pdflatex
\documentclass[10pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[left=1in,right=1in,bottom=1in,top=1in]{geometry}
\date{Spring 2019}
\title{PSYC 3435: Principles of Research for the Behavioral Sciences}
\hypersetup{
 pdfauthor={},
 pdftitle={PSYC 3435: Principles of Research for the Behavioral Sciences},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{Contact info}
\label{sec:orgbad9fa5}
\begin{itemize}
\item Professor: Thomas J. Faulkenberry, Ph.D
\item Office: Math 319
\item Office hours: MWF 1-3 pm, TR 9-11 am
\item Email: faulkenberry@tarleton.edu
\item Website: \url{http://tomfaulkenberry.github.io}
\item Phone: 254-968-9816
\end{itemize}

\section*{Course description}
\label{sec:orgc517fe8}

This laboratory course is designed to introduce students to the philosophy of scientific inquiry with an emphasis on experimental methodology. This will be accomplished via a combination of traditional lectures along with an application of principles through laboratory experimentation and demonstration. Essentially, we will cover the "nuts and bolts" of putting together and completing a research project in psychology. To this end, we will cover all fourteen chapters of the textbook. All students enrolled in this course are required to have \textbf{previously taken} PSYC 3309 (Writing in Psychology) and PSYC 3330 (Statistics). 

\section*{Course materials}
\label{sec:orgddb3cfa}

\begin{itemize}
\item \emph{The Process of Research in Psychology} (3rd ed.) by McBride (2015) \href{https://www.amazon.com/Process-Research-Psychology-Dawn-McBride/dp/1483347605/}{Amazon link}
\item \emph{APA Publication Manual} (6th ed.) \href{http://www.amazon.com/Publication-Manual-American-Psychological-Association/dp/1433805618/}{Amazon link}
\item JASP statistical software (free download from \href{http://jasp-stats.org}{jasp-stats.org})
\end{itemize}

\section*{Student learning outcomes}
\label{sec:org0a4502b}

\begin{enumerate}
\item Describe advantages of the scientific method compared to other approaches
\item Identify various research designs and uses of each
\item Conduct library research
\item Paraphrase and cite material from primary sources
\item Develop a research question and write hypotheses appropriate for it
\item Design and conduct a research project to test hypotheses
\item Analyze data collected from research using computer software
\item Communicate the findings of research as a complete APA style manuscript
\end{enumerate}

\section*{Requirements and grading}
\label{sec:orgb2ce2bc}

\begin{itemize}
\item Exam 1 (100 pts)
\item Exam 2 (100 pts)
\item Exam 3 (100 pts)
\item Final exam (150 pts)
\item Unit quizzes (100 pts)
\item Lab assignments (100 pts)
\item Research participation (50 pts)
\item \emph{Total = 700 points}
\end{itemize}

Grades will be assigned based on the percentage of points you accumulate out of these 700 points.  I will use the standard grading scale of A=90\%, B=80\%, etc.

\subsection*{Exams (64\% of grade)}
\label{sec:orgbd34a45}
There will be four exams throughout the semester.  They will cover material from the text and the lectures.  Exam questions will be a mix of multiple choice and short answer and will be worth 100 points each.

Dates:

\begin{itemize}
\item Exam 1 (Wednesday, Feb 13)
\item Exam 2 (Wednesday, March 27)
\item Exam 3 (Wednesday, April 24)
\item Final exam (Monday, May 6, 3:00-5:30 pm)
\end{itemize}

\subsection*{Unit quizzes (14\% of grade)}
\label{sec:org8b5f3ed}

Every Friday (excluding exam weeks), there will be a short in-class quiz over the material covered in lectures on Monday and Wednesday. Typically, the quizzes will consist of multiple choice questions, although the format may change occasionally depending on material.  Your final quiz average will be scaled to a total of 100 points for the semester (i.e., if you average 8.6/10 points over all quizzes, your final quiz grade will be 86/100).
