spring2019/psyc3435/psyc3435-spring2019.tex

\subsection*{Lab assignments (14\% of grade)}
\label{sec:org40f6c28}

There will be four lab assignments this semester.  Each assignment is designed to give you first hand experience with essential research skills, such as conducting an experiment, collecting data, and writing up an APA manuscript.  Except for Lab 1 (an APA exercise), each of you will administer a short experiment, collect some data, analyze the collected data for the class, and compose an APA manuscript based on the experiment and the results. 

Lab Assignments and dates

\begin{itemize}
\item Lab 1 – APA formatting (10 points), due Friday, Feb 8
\item Lab 2.1 – Chi-squared design, data collection (10 points), due Friday, Feb 22
\item Lab 2.2 – Chi-squared design, analysis and report (20 points), due Friday, Mar 8
\item Lab 3.1 – Independent groups design, data collection (10 points), due Friday, Mar 22
\item Lab 3.2 – Independent groups design, analysis and report (20 points), due Friday, Apr 5
\item Lab 4.1 – Factorial design, data collection (10 points), due Friday, Apr 12
\item Lab 4.2 – Factorial design, analysis and report (20 points), due Friday, Apr 26
\end{itemize}

\subsection*{Research participation (8\% of grade)}
\label{sec:orgd0eb3a6}

Research is the lifeblood of psychology!  In order to promote your growth as a psychological scientist, you will be required to participate in 2 "units" of research over the course of the semester.  Roughly defined, a "unit" of research consists of either (1) participation in one hour of psychological experiments, usually offered right here in the Psychology department at Tarleton, or (2) a 3-5 page critical reflection of an empirical research article related to human learning and/or cognition, usually chosen by me.  Instructions for participation will be given in class.

\section*{Course Communication}
\label{sec:org542672d}

Email is the primary means of communication for this course.  If you have questions about the course, always feel free to send me an email at faulkenberry@tarleton.edu.  I only ask that you adhere to two guidelines:
\begin{itemize}
\item please include the course number (PSYC 3435) in the subject line.  For example, one good way to do this is:  Subject: [PSYC 3435] Question about Lab 2
\item please use proper email etiquette.  Include a salutation (e.g., Dear Dr. Faulkenberry), complete sentences, and a closing (e.g., "Regards, Your Name").  You might be surprised how many times I get an email from a nondescript email address with no indication from WHOM the email was sent!
\end{itemize}

Also, I will be sending periodic emails to each of you that update you on course progress, due dates, etc.  It is imperative that you check your \emph{Tarleton email address} regularly so that you don't miss any of these messages.

\section*{University Policy on "F" Grades}
\label{sec:orgb5a1865}
Beginning in Fall 2015, Tarleton began differentiating between a failed grade in a class because a student never attended (F0 grade), stopped attending at some point in the semester (FX grade), or because the student did not pass the course (F) but attended the entire semester. These grades will be noted on the official transcript. Stopping or never attending class can result in the student having to return aid monies received.  For more information see the Tarleton Financial Aid website.

\section*{Academic Honesty}
\label{sec:org6605435}

Cheating, plagiarism (submitting another person’s materials or ideas as one’s own without proper attribution), or doing work for another person who will receive academic credit are all disallowed. This includes the use of unauthorized books, notebooks, or other sources in order to secure of give help during an examination, the unauthorized copying of examinations, assignments, reports, or term papers, or the presentation of unacknowledged material as if it were the student’s own work. Disciplinary action may be taken beyond the academic discipline administered by the faculty member who teaches the course in which the cheating took place.

The minimum sanction for \emph{any} act of academic dishonesty is a grade of 0 on the affected assignment; a grade of F for the course may be assigned in severe cases.

\section*{Academic Affairs Core Value Statements}
\label{sec:orgaf08780}

\subsection*{Academic Integrity Statement}
\label{sec:org5c0b301}
Tarleton State University's core values are integrity, leadership, tradition, civility, excellence, and service.  Central to these values is integrity, which is maintaining a high standard of personal and scholarly conduct.  Academic integrity represents the choice to uphold ethical responsibility for one’s learning within the academic community, regardless of audience or situation.
