spring2019/psyc3435/psyc3435-spring2019.html

<div id="outline-container-org37ceae6" class="outline-3">
<h3 id="org37ceae6">Academic Civility Statement</h3>
<div class="outline-text-3" id="text-org37ceae6">
<p>
Students are expected to interact with professors and peers in a respectful manner that enhances the learning environment. Professors may require a student who deviates from this expectation to leave the face-to-face (or virtual) classroom learning environment for that particular class session (and potentially subsequent class sessions) for a specific amount of time. In addition, the professor might consider the university disciplinary process (for Academic Affairs/Student Life) for egregious or continued disruptive behavior.
</p>
</div>
</div>

<div id="outline-container-orgb58be8c" class="outline-3">
<h3 id="orgb58be8c">Academic Excellence Statement</h3>
<div class="outline-text-3" id="text-orgb58be8c">
<p>
Tarleton holds high expectations for students to assume responsibility for their own individual learning. Students are also expected to achieve academic excellence by:
</p>
<ul class="org-ul">
<li>honoring Tarleton’s core values, upholding high standards of habit and behavior.</li>
<li>maintaining excellence through class attendance and punctuality, preparing for active participation in all learning experiences.</li>
<li>putting forth their best individual effort.</li>
<li>continually improving as independent learners.</li>
<li>engaging in extracurricular opportunities that encourage personal and academic growth.</li>
<li>reflecting critically upon feedback and applying these lessons to meet future challenges.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga8f22df" class="outline-2">
<h2 id="orga8f22df">Students with Disabilities Policy</h2>
<div class="outline-text-2" id="text-orga8f22df">
<p>
It is the policy of Tarleton State University to comply with the Americans with Disabilities  Act (www.ada.gov) and other applicable laws.  If you are a student with a disability seeking accommodations for this course, please contact the Center for Access and Academic Testing, at 254.968.9400 or caat@tarleton.edu. The office is located in Math 201. More information can be found at www.tarleton.edu/caat or in the University Catalog.​
</p>

<p>
<b>Note:  any changes to this syllabus will be communicated to you by the instructor!</b>
</p>
</div>
</div>

<div id="outline-container-org1e66346" class="outline-2">
<h2 id="org1e66346">Schedule of lectures</h2>
<div class="outline-text-2" id="text-org1e66346">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Week</th>
<th scope="col" class="org-left">Dates</th>
<th scope="col" class="org-left">Lecture topic</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Jan 14-18</td>
<td class="org-left">Knowing in psychological science (Ch 1)</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Jan 21-25</td>
<td class="org-left">Reading the literature / APA style (Ch 2,8)</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Jan 28-Feb 1</td>
<td class="org-left">Basic research methods (Ch 3)</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Feb 4-8</td>
<td class="org-left">Ethics in psychological science (Ch 5)</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Feb 11-15</td>
<td class="org-left"><b>Exam 1</b></td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">Feb 18-22</td>
<td class="org-left">Experiments: selecting and manipulating variables (Ch 4)</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">Feb 25-Mar 1</td>
<td class="org-left">Experiments: sampling methods (Ch 6)</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">Mar 4-8</td>
<td class="org-left">Experiments: basic designs (Ch 11)</td>
</tr>

<tr>
<td class="org-right">-</td>
<td class="org-left">Mar 11-15</td>
<td class="org-left"><b>Spring break!</b></td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">Mar 18-22</td>
<td class="org-left">Experiments: factorial designs (Ch 11)</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">Mar 25-29</td>
<td class="org-left"><b>Exam 2</b></td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">Apr 1-5</td>
<td class="org-left">Non-experiments: correlations and regression (Ch 10)</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">Apr 8-12</td>
<td class="org-left">Non-experiments: quasi-experiments (Ch 12)</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-left">Apr 15-19</td>
<td class="org-left">Non-experiments: developmental designs (Ch 13)</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">Apr 22-26</td>
<td class="org-left"><b>Exam 3</b></td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-left">Apr 29-May 1</td>
<td class="org-left">Course review</td>
</tr>

<tr>
<td class="org-right">16</td>
<td class="org-left">May 6-10</td>
<td class="org-left"><b>Final exam: Monday, May 6, 3:00-5:30 pm</b></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Spring 2019</p>
<p class="date">Created: 2019-01-14 Mon 09:21</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
