spring2019/psyc3435/psyc3435-spring2019.tex

\subsection*{Academic Civility Statement}
\label{sec:org14a592d}
Students are expected to interact with professors and peers in a respectful manner that enhances the learning environment. Professors may require a student who deviates from this expectation to leave the face-to-face (or virtual) classroom learning environment for that particular class session (and potentially subsequent class sessions) for a specific amount of time. In addition, the professor might consider the university disciplinary process (for Academic Affairs/Student Life) for egregious or continued disruptive behavior.

\subsection*{Academic Excellence Statement}
\label{sec:org48a7f78}
Tarleton holds high expectations for students to assume responsibility for their own individual learning. Students are also expected to achieve academic excellence by:
\begin{itemize}
\item honoring Tarleton’s core values, upholding high standards of habit and behavior.
\item maintaining excellence through class attendance and punctuality, preparing for active participation in all learning experiences.
\item putting forth their best individual effort.
\item continually improving as independent learners.
\item engaging in extracurricular opportunities that encourage personal and academic growth.
\item reflecting critically upon feedback and applying these lessons to meet future challenges.
\end{itemize}

\section*{Students with Disabilities Policy}
\label{sec:org662d3ae}

It is the policy of Tarleton State University to comply with the Americans with Disabilities  Act (www.ada.gov) and other applicable laws.  If you are a student with a disability seeking accommodations for this course, please contact the Center for Access and Academic Testing, at 254.968.9400 or caat@tarleton.edu. The office is located in Math 201. More information can be found at www.tarleton.edu/caat or in the University Catalog.​

\textbf{Note:  any changes to this syllabus will be communicated to you by the instructor!}

\section*{Schedule of lectures}
\label{sec:orgb115e8f}

\begin{center}
\begin{tabular}{rll}
Week & Dates & Lecture topic\\
\hline
1 & Jan 14-18 & Knowing in psychological science (Ch 1)\\
2 & Jan 21-25 & Reading the literature / APA style (Ch 2,8)\\
3 & Jan 28-Feb 1 & Basic research methods (Ch 3)\\
4 & Feb 4-8 & Ethics in psychological science (Ch 5)\\
5 & Feb 11-15 & \textbf{Exam 1}\\
6 & Feb 18-22 & Experiments: selecting and manipulating variables (Ch 4)\\
7 & Feb 25-Mar 1 & Experiments: sampling methods (Ch 6)\\
8 & Mar 4-8 & Experiments: basic designs (Ch 11)\\
- & Mar 11-15 & \textbf{Spring break!}\\
9 & Mar 18-22 & Experiments: factorial designs (Ch 11)\\
10 & Mar 25-29 & \textbf{Exam 2}\\
11 & Apr 1-5 & Non-experiments: correlations and regression (Ch 10)\\
12 & Apr 8-12 & Non-experiments: quasi-experiments (Ch 12)\\
13 & Apr 15-19 & Non-experiments: developmental designs (Ch 13)\\
14 & Apr 22-26 & \textbf{Exam 3}\\
15 & Apr 29-May 1 & Course review\\
16 & May 6-10 & \textbf{Final exam: Monday, May 6, 3:00-5:30 pm}\\
\end{tabular}
\end{center}
\end{document}